tests/fixtures/cassettes/test_get_tracking_code_events.yaml

interactions:
- request:
    body: <?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/"
      xmlns:ns1="http://resource.webservice.correios.com.br/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
      xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><SOAP-ENV:Header/><ns0:Body><ns1:buscaEventosLista><usuario>sigep</usuario><senha>n5f9t8</senha><tipo>L</tipo><resultado>T</resultado><lingua>101</lingua><objetos>FJ064849483BR</objetos></ns1:buscaEventosLista></ns0:Body></SOAP-ENV:Envelope>
    headers:
      Accept: ['*/*']
      Accept-Encoding: ['gzip, deflate']
      Connection: [keep-alive]
      Content-Length: ['527']
      Content-Type: [text/xml; charset=utf-8]
      SOAPAction:
      - !!binary |
        ImJ1c2NhRXZlbnRvc0xpc3RhIg==
      User-Agent: [python-requests/2.10.0]
    method: POST
    uri: http://webservice.correios.com.br/service/rastro
  response:
    body: {string: "<?xml version=\"1.0\" encoding=\"utf-8\"?><soapenv:Envelope xmlns:soapenv=\"\
        http://schemas.xmlsoap.org/soap/envelope/\"><soapenv:Header><X-OPNET-Transaction-Trace:X-OPNET-Transaction-Trace\
        \ xmlns:X-OPNET-Transaction-Trace=\"http://opnet.com\">pid=58921,requestid=542ca844870b70c7518a556232cf8cb585555bac8d270143</X-OPNET-Transaction-Trace:X-OPNET-Transaction-Trace></soapenv:Header><soapenv:Body><ns2:buscaEventosListaResponse\
        \ xmlns:ns2=\"http://resource.webservice.correios.com.br/\"><return><versao>2.0</versao><qtd>1</qtd><objeto><numero>FJ064849483BR</numero><sigla>FJ</sigla><nome>REMESSA\
        \ ECON\xD4MICA C/ AR DIGITAL</nome><categoria>REMESSA ECON\xD4MICA TAL\xC3\
        O/CART\xC3O</categoria><evento><tipo>BDE</tipo><status>01</status><data>14/07/2016</data><hora>16:24</hora><descricao>Objeto\
        \ entregue ao destinat\xE1rio</descricao><recebedor>                     \
        \                                                   </recebedor><documento>\
        \                         </documento><comentario>                       \
        \  </comentario><local>CDD CAPAO DA IMBUIA</local><codigo>82801970</codigo><cidade>CURITIBA</cidade><uf>PR</uf></evento><evento><tipo>OEC</tipo><status>01</status><data>14/07/2016</data><hora>09:46</hora><descricao>Objeto\
        \ saiu para entrega ao destinat\xE1rio</descricao><local>CDD CAPAO DA IMBUIA</local><codigo>82801970</codigo><cidade>CURITIBA</cidade><uf>PR</uf></evento><evento><tipo>PO</tipo><status>01</status><data>13/07/2016</data><hora>17:58</hora><descricao>Objeto\
        \ postado</descricao><local>CTC CURITIBA/GCCAP</local><codigo>80235971</codigo><cidade>CURITIBA</cidade><uf>PR</uf></evento></objeto></return></ns2:buscaEventosListaResponse></soapenv:Body></soapenv:Envelope>"}
    headers:
      Cache-Control: ['no-cache="set-cookie, set-cookie2"']
      Connection: [Keep-Alive]
      Content-Language: [pt-BR]
      Content-Length: ['1665']
      Content-Type: [text/xml; charset=utf-8]
      Date: ['Mon, 25 Jul 2016 05:20:03 GMT']
      Expires: ['Thu, 01 Dec 1994 16:00:00 GMT']
      Keep-Alive: ['timeout=10, max=41']
      Set-Cookie: [_op_aixPageId=a2_f46467a0-04c5-47b1-a9d3-bd2ca4e15546; Path=/]
      X-OPNET-Transaction-Trace: [a2_f46467a0-04c5-47b1-a9d3-bd2ca4e15546]
      X-Powered-By: [Servlet/3.0]
    status: {code: 200, message: OK}
version: 1
